In [1]:
import numpy as np
import pandas as pd

### 데이터 프레임 생성

**리스트로 데이터 프레임 만들기**
* DataFrame([[리스트],[리스트]])
* 각 리스트는 한 행으로 구성됨.
* 행의 원소 개수가 다르면 None 값으로 저장

In [2]:
df = pd.DataFrame([['a','b','c'],['a','a','g'],['a','a']])
df

   0  1     2
0  a  b     c
1  a  a     g
2  a  a  None

In [3]:
# 딕셔너리로 데이터 프레임 생성
df1 = pd.DataFrame({'A':(90,80,70),'B':(85,98,75), 
                    'C':(88,99,77), 'D':(87, 89, 86)})
df1

    A   B   C   D
0  90  85  88  87
1  80  98  99  89
2  70  75  77  86

In [4]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2000002],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율":[0.0283, 0.0163, 0.0982,0.0141]
}
columns = ['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율']
index = ['서울','부산','인천','대구']

In [5]:
df2 = pd.DataFrame(data, index = index, columns = columns)
df2

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

**시리즈로 데이터 프레임 생성**
* 각 시리즈의 인덱스 -> columns

In [6]:
a = pd.Series([100,200,300], ['a','b','d'])
b = pd.Series([101,201,301], ['a','b','k'])
c = pd.Series([110,210,310], ['a','b','c'])

pd.DataFrame([a,b,c], index=[100,101,102])

         a      b      d      k      c
100  100.0  200.0  300.0    NaN    NaN
101  101.0  201.0    NaN  301.0    NaN
102  110.0  210.0    NaN    NaN  310.0

In [15]:
train = pd.read_csv('/Users/anmunju/Documents/multicam_ds/3_jupyterNotebook/data/train.csv', index_col='PassengerId',
                       usecols=['PassengerId','Survived','Pclass', 'Name'])
train.head()

,Survived,Pclass,Name
PassengerId,,,
1,0,3,"Braund, Mr. Owen Harris"
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
3,1,3,"Heikkinen, Miss. Laina"
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
5,0,3,"Allen, Mr. William Henry"

In [16]:
df2

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [23]:
df2.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [24]:
df2.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [25]:
df2.index.name = '도시'
df2.columns.name = '특성'

df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2000002  2456016  2473990         0.0141

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 서울 to 대구
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   지역             4 non-null      object
 1   2015           4 non-null      int64
 2   2010           4 non-null      int64
 3   2005           4 non-null      int64
 4   2000           4 non-null      int64
 5   2010-2015 증가율  4 non-null      float64
dtypes: float64(1), int64(4), object(1)
memory usage: 224.0+ bytes

In [28]:
df2.describe()

특성             2015          2010          2005          2000  2010-2015 증가율
count  4.000000e+00  4.000000e+00  4.000000e+00  4.000000e+00       4.000000
mean   4.677388e+06  4.414178e+06  4.562197e+06  4.612434e+06       0.039225
std    3.507776e+06  3.524531e+06  3.500545e+06  3.538749e+06       0.039809
min    2.466052e+06  2.000002e+06  2.456016e+06  2.466338e+06       0.014100
25%    2.784351e+06  2.474027e+06  2.502264e+06  2.472077e+06       0.015750
50%    3.169594e+06  3.012613e+06  3.015114e+06  3.064714e+06       0.022300
75%    5.062631e+06  4.952764e+06  5.075047e+06  5.205071e+06       0.045775
max    9.904312e+06  9.631482e+06  9.762546e+06  9.853972e+06       0.098200

In [31]:
dfT = df2.T
dfT #행렬 변환 (전치)

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2000002
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [32]:
# 열 내용 변경
df2['2010-2015 증가율'] *= 100
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2000002  2456016  2473990           1.41

In [37]:
df2['새로운 열'] = np.NaN
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율  새로운 열
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83    NaN
부산  경상권  3448737  3393191  3512547  3655437           1.63    NaN
인천  수도권  2890451  2632035  2517680  2466338           9.82    NaN
대구  경상권  2466052  2000002  2456016  2473990           1.41    NaN

In [38]:
del df2['새로운 열']
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2000002  2456016  2473990           1.41

In [40]:
df2['2005 - 2015 증가율(%)'] = ((df2['2015'] - df2['2005']) / df2['2005'] * 100).round(2)
df2

특성,지역,2015,2010,2005,2000,2010-2015 증가율,2005 - 2015 증가율,2005 - 2015 증가율(%)
도시,,,,,,,,
서울,수도권,9904312,9631482,9762546,9853972,2.83,1.45,1.45
부산,경상권,3448737,3393191,3512547,3655437,1.63,-1.82,-1.82
인천,수도권,2890451,2632035,2517680,2466338,9.82,14.81,14.81
대구,경상권,2466052,2000002,2456016,2473990,1.41,0.41,0.41

In [42]:
df2

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005 - 2015 증가율(%)
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83                1.45
부산  경상권  3448737  3393191  3512547  3655437           1.63               -1.82
인천  수도권  2890451  2632035  2517680  2466338           9.82               14.81
대구  경상권  2466052  2000002  2456016  2473990           1.41                0.41

**데이터 프레임 인덱싱**
1. 열 인덱싱
2. 인덱서를 사용하지 않는 행 인덱싱
* []는 열 위주 인덱싱이 원칙

In [43]:
type(df2['지역'])

pandas.core.series.Series

In [44]:
type(df2[['지역']])

pandas.core.frame.DataFrame

In [51]:
df2[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2000002  2466052

In [52]:
df2['2010']

도시
서울    9631482
부산    3393191
인천    2632035
대구    2000002
Name: 2010, dtype: int64

In [53]:
try:
    df2[0]
except Exception as e:
    print(type(e))

<class 'KeyError'>

In [61]:
# 행단위 인덱싱
df2.loc['서울']

특성
지역                        수도권
2015                  9904312
2010                  9631482
2005                  9762546
2000                  9853972
2010-2015 증가율            2.83
2005 - 2015 증가율(%)       1.45
Name: 서울, dtype: object

In [63]:
df2[1:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005 - 2015 증가율(%)
도시
부산  경상권  3448737  3393191  3512547  3655437           1.63               -1.82

In [69]:
df2['2015']['인천':]

도시
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [67]:
type(df2['2015']['서울'])

numpy.int64

- DF는 열 기준으로 접근이 기본 []
- 행 기준 접근을 위해서는 슬라이싱 사용 [:]
- 행, 열 동시에 접근하려면 [열][행]

In [71]:
# 변수 명 두번 작성시 두번 다 출력되도록!
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [77]:
df2.loc['서울']['2015'] == df2['2015']['서울']

True

In [78]:
df = pd.DataFrame(np.arange(10,22).reshape(3,4),
index = 'a b c'.split(),
columns = 'A B C D'.split())
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [81]:
df[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [86]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),
columns = 'a b c d'.split())
df2

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [89]:
df.loc['a','A'] = 50

In [90]:
df

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

In [94]:
df.loc['a', :] # 시리즈 반환

A    50
B    11
C    12
D    13
Name: a, dtype: int64

In [93]:
df.loc[['a']] # 데이터 프레임 반환

    A   B   C   D
a  50  11  12  13

In [97]:
df.loc['b':,:] # loc[행:열]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [122]:
df.loc[['a','b'],['B','D']]
df[['B','D']]['a':'b']

    B   D
a  11  13
b  15  17

    B   D
a  11  13
b  15  17

- iloc[행위치,열위치] -> 원소값 반환
- iloc[행위치1:행위치2,열위치1:열위치2] -> 원소 반환: df 반환
- iloc[행위치,열위치1:열위치2] -> 원소반환 :시리즈 반환
- iloc[행위치1:행위치2,열위치]->원소반환 : 시리즈 반환

In [134]:
df0 = pd.DataFrame(np.arange(25, 50).reshape(5,5), 
columns = 'A B C D E'.split(),
index = 'a b c d e'.split())
df0

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39
d  40  41  42  43  44
e  45  46  47  48  49

In [138]:
df0['A']

a    25
b    30
c    35
d    40
e    45
Name: A, dtype: int64

In [139]:
df0[0:3]

    A   B   C   D   E
a  25  26  27  28  29
b  30  31  32  33  34
c  35  36  37  38  39

In [182]:
df0.iloc[1,3:5]
df0[['D','E']][1:2]

D    33
E    34
Name: b, dtype: int64

    D   E
b  33  34

In [179]:
df0.loc['a':'c',['B','D']]

    B   D
a  26  28
b  31  33
c  36  38